XR-bin/STM32-learning-1/STM32F407ZGT6/M4（30、IWDG看门狗练习）/SYSTEM/nvic/nvic.c
#include "stm32f4xx.h"  
#include "stdio.h"
#include "nvic.h"
#include "string.h"
#include "led.h"
#include "w25q64.h"

static void delay_ms(u32 ms)
{
	u32 i = 168 / 4 * 1000 * ms;
	while(i)
	{
		i--;
	}
}

u32 temp = 1;

/******************************************************************
*函数功能  ：串口1的中断服务函数
*函数名    ：USART1_IRQHandler
*函数参数  ：void
*函数返回值：void
*描述      ：
*******************************************************************/
void USART1_IRQHandler(void)
{
//  static u32 addr = 0x0b0000;
  
  //判断是由什么形式触发中断
  if(USART1->SR & (1<<5))
  {
    //执行中断任务
    USART1->DR;
    LED1_ON;
  }
  if(USART1->SR & (1<<4))
  {
    USART1->SR;
    USART1->DR;
    LED1_OFF;
  }
}

/******************************************************************
*函数功能  ：串口2的中断服务函数
*函数名    ：USART2_IRQHandler
*函数参数  ：void
*函数返回值：void
*描述      ：
*******************************************************************/
void USART2_IRQHandler(void)
{
  
  //判断是由什么形式触发中断
  if(USART2->SR & (1<<5))
  {
    //执行中断任务
    USART2->DR;
  }
}

/******************************************************************
*函数功能  ：外部中断1服务函数
*函数名    ：EXTI0_IRQHandler
*函数参数  ：void
*函数返回值：void
*描述      ：
*******************************************************************/
void EXTI0_IRQHandler(void)
{
  if(EXTI->PR & (1<<0))
  {
    delay_ms(10);
    if((GPIOA->IDR & (1<<0)))
    {
      EXTI->PR |= (1<<0);
      GPIOF->ODR ^= (1<<6);
      GPIOF->ODR ^= (1<<9);
      GPIOF->ODR ^= (1<<10);
      GPIOC->ODR ^= (1<<0);
    }
  }
}

void SysTick_Handler(void)
{
  if(SysTick->CTRL & (1<<16))
  {
    //将当前值寄存器清零   //随便写一个数据进入
    SysTick->VAL = 0xff;
    GPIOF->ODR ^= (1<<6);
  }
}

/******************************************************************
*函数功能  ：ADC中断服务函数
*函数名    ：ADC_IRQHandler
*函数参数  ：void
*函数返回值：void
*描述      ：
*******************************************************************/
void ADC_IRQHandler(void)
{
  u16 data;
  if(ADC1->SR & (1<<1))
  { 
    //读取转换后的数据
    data = ADC1->DR;
    printf("data:%d\r\n",data);
  }
  //开启规则通道转换开关
  ADC1->CR2 |= (1<<30);
}

/******************************************
*函数功能  ：定时器6的中断服务函数
*函数名    ：TIM6_DAC_IRQHandler ：
*函数参数  ：无
*函数返回值：无
*函数描述  ：
*********************************************/
void TIM6_DAC_IRQHandler(void)
{
	//判断是否定时器6中断
	if(TIM6->SR & (1<<0))
	{
		//清中断标志位
		TIM6->SR &= ~(1<<0);
		//紧急事件
		GPIOF->ODR ^= ((1<<6)|(1<<9)|(1<<10));
	}
}

/******************************************
*函数功能  ：定时器6的中断服务函数
*函数名    ：TIM6_DAC_IRQHandler ：
*函数参数  ：无
*函数返回值：无
*函数描述  ：
*********************************************/
void TIM7_IRQHandler(void)
{
	//判断是否定时器6中断
	if(TIM7->SR & (1<<0))
	{
		 static u8 temp = 0;
		//清中断标志位
		TIM7->SR &= ~(1<<0);
		//紧急事件
		if(temp == 0)
    {
      if(TIM10->CCR1 == 0) temp = 1;
      else TIM10->CCR1 -=50;
    }
    if(temp == 1)
    {
      if(TIM10->CCR1 == 1000) temp = 0;
      else TIM10->CCR1 +=50;
    }
	}
}










